/*
 * Это скетч из проекта "Умная аудитория", предназначенный для работы на внешнем микроконтроллере,
 * который должен заниматься сбором, обработкой и обменом некоторой информацией с терминальным устройстом,
 * а также управлением внешними устройствами, вроде освещения, сервоприводов, электропитания и прочего.
 *
 * Автор: @allonny89
 */

/*
 * {"echo":"ECHO"}
 * {"system":"REBOOT"}$
 * {"system":"RESET"}$
 * {"pinmap":"0808010301030301010303020000050505051010"}$
 * {"config":"0001000000000000000000D0E0F0000000000001"}$
 * {"config":"0001445566778800000000D0E0F0000000000001"}$
 * {"config":"0001101020102020000000D0E0F0000000000001"}$
 * {"config":"0001101120122122000000D0E0F0000000000001"}$
 *             0 1 2 3 4 5 6 7 8 9 
 * {"config":"0001000000002010001000D0E0F0000000000001"}$
 * {"config":"GET"}$
 * {"config":"MAP"}$
 * {"config":"RESET"}$
 * {"config":"SAVE"}$
 * {"config":"LOAD"}$
 * {"echo":"ECHO"}$
 * {"light":"GET"}$
 * {"light":"00FF"}$
 * {"window":"GET"}$
 * {"window":"00FF"}$
 * {"light":"GET","window":"GET","power_supply":"GET"}$
 */


